# GetDownstreamNodeIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalAnalyticalNode..::..GetDownstreamNodeIds Method
ElectricalAnalyticalNode Class See Also
---
Gets the downstream node ids.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public IList<ElementId> GetDownstreamNodeIds()
```

Visual Basic
---
```text
Public Function GetDownstreamNodeIds As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetDownstreamNodeIds()
```

# ### Return Value
The array of downstream node ids.
# Remarks
If node B supplies from node A, node B is the downstream node of node A, and node A is the upstream node of node B. Usually one node may have many downstream nodes, but TransferSwitch can only have one downstream node.
# See Also
ElectricalAnalyticalNode Class
Autodesk.Revit.DB.Electrical Namespace